<?php
Yii::setAlias('@common', dirname(__DIR__));
Yii::setAlias('@frontend', dirname(dirname(__DIR__)) . '/frontend');
Yii::setAlias('@backend', dirname(dirname(__DIR__)) . '/backend');
Yii::setAlias('@console', dirname(dirname(__DIR__)) . '/console');


/**
 * Returns the string with the correct format to SEO
 * @return string
 */
function seoParam($title)
{
    $str = mb_strtolower(trim($title), 'utf-8');
    $str = strtr($str, array(
        'á' => 'a', 'é' => 'e', 'í' => 'i', ' ó' => 'o', 'ú' => 'u', 'ñ' => 'n', 'À' => 'a', 'Á' => 'a', 'Â' => 'a',
        'Ã' => 'a', 'Ä' => 'a', 'Å' => 'a', 'Ā' => 'a', 'Ą' => 'a', 'Ă' => 'a', 'Æ' => 'a', 'Ç' => 'c', 'Ć' => 'c',
        'Č' => 'c', 'Ĉ' => 'c', 'Ċ' => 'c', 'Ď' => 'd', 'Đ' => 'd', 'È' => 'e', 'É' => 'e', 'Ê' => 'e', 'Ë' => 'e',
        'Ē' => 'e', 'Ę' => 'e', 'Ě' => 'e', 'Ĕ' => 'e', 'Ė' => 'e', 'Ĝ' => 'g', 'Ğ' => 'g', 'Ġ' => 'g', 'Ģ' => 'g',
        'Ĥ' => 'h', 'Ħ' => 'h', 'Ì' => 'i', 'Í' => 'i', 'Î' => 'i', 'Ï' => 'i', 'Ī' => 'i', 'Ĩ' => 'i', 'Ĭ' => 'i',
        'Į' => 'i', 'İ' => 'i', 'Ĵ' => 'j', 'Ķ' => 'k', 'Ł' => 'l', 'Ľ' => 'l', 'Ĺ' => 'l', 'Ļ' => 'l', 'Ŀ' => 'l',
        'Ñ' => 'n', 'Ń' => 'n', 'Ň' => 'n', 'Ņ' => 'n', 'Ŋ' => 'n', 'Ò' => 'o', 'Ó' => 'o', 'Ô' => 'o', 'Õ' => 'o',
        'Ö' => 'o', 'Ø' => 'o', 'Ō' => 'o', 'Ő' => 'o', 'Ŏ' => 'o', 'Ŕ' => 'r', 'Ř' => 'r', 'Ŗ' => 'r', 'Ś' => 's',
        'Š' => 's', 'Ş' => 's', 'Ŝ' => 's', 'Ș' => 's', 'Ť' => 't', 'Ţ' => 't', 'Ŧ' => 't', 'Ț' => 't', 'Ù' => 'u',
        'Ú' => 'u', 'Û' => 'u', 'Ü' => 'u', 'Ū' => 'u', 'Ů' => 'u', 'Ű' => 'u', 'Ŭ' => 'u', 'Ũ' => 'u', 'Ų' => 'u',
        'Ŵ' => 'w', 'Ý' => 'y', 'Ŷ' => 'y', 'Ÿ' => 'y', 'Ź' => 'z', 'Ž' => 'z', 'Ż' => 'z', 'à' => 'a', 'á' => 'a',
        'â' => 'a', 'ã' => 'a', 'ä' => 'a', 'å' => 'a', 'ā' => 'a', 'ą' => 'a', 'ă' => 'a', 'ç' => 'c', 'ć' => 'c',
        'č' => 'c', 'ĉ' => 'c', 'ċ' => 'c', 'ď' => 'd', 'đ' => 'd', 'è' => 'e', 'é' => 'e', 'ê' => 'e', 'ë' => 'e',
        'ē' => 'e', 'ę' => 'e', 'ě' => 'e', 'ĕ' => 'e', 'ė' => 'e', 'ƒ' => 'f', 'ĝ' => 'g', 'ğ' => 'g', 'ġ' => 'g',
        'ģ' => 'g', 'ĥ' => 'h', 'ħ' => 'h', 'ì' => 'i', 'í' => 'i', 'î' => 'i', 'ï' => 'i', 'ī' => 'i', 'ĩ' => 'i',
        'ĭ' => 'i', 'į' => 'i', 'ı' => 'i', 'ĵ' => 'j', 'ķ' => 'k', 'ĸ' => 'k', 'ł' => 'l', 'ľ' => 'l', 'ĺ' => 'l',
        'ļ' => 'l', 'ŀ' => 'l', 'ñ' => 'n', 'ń' => 'n', 'ň' => 'n', 'ņ' => 'n', 'ò' => 'o', 'ó' => 'o', 'ô' => 'o',
        'õ' => 'o', 'ö' => 'o', 'ø' => 'o', 'ō' => 'o', 'ő' => 'o', 'ŏ' => 'o', 'ŕ' => 'r', 'ř' => 'r', 'ŗ' => 'r',
        'ś' => 's', 'š' => 's', 'ş' => 's', 'ŝ' => 's', 'ș' => 's', 'ť' => 't', 'ţ' => 't', 'ŧ' => 't', 'ț' => 't',
        'ù' => 'u', 'ú' => 'u', 'û' => 'u', 'ü' => 'u', 'ū' => 'u', 'ů' => 'u', 'ű' => 'u', 'ŭ' => 'u', 'ũ' => 'u',
        'ų' => 'u', 'ŵ' => 'w', 'ý' => 'y', 'ÿ' => 'y', 'ŷ' => 'y', 'ž' => 'z', 'ż' => 'z', 'ź' => 'z', 'ð' => 'o'));
    $str = preg_replace('/[^a-z0-9-]/', '-', $str);
    $str = preg_replace('/-+/', "-", $str);
    return $str;
}